tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf46k80_tdd.h
#define RC1IE                         4439
#define ADIE                          4440
#define PSPIE                         4441
#define PIR1                          4442
#define TMR1IF                        4443
#define TMR2IF                        4444
#define TMR1GIF                       4445
#define SSPIF                         4446
#define PIR1_TX1IF                    4447
#define TXIF                          4448
#define RCIF                          4449
#define RC1IF                         4450
#define ADIF                          4451
#define PSPIF                         4452
#define IPR1                          4453
#define TMR1IP                        4454
#define TMR2IP                        4455
#define TMR1GIP                       4456
#define SSPIP                         4457
#define TX1IP                         4458
#define TXIP                          4459
#define RCIP                          4460
#define RC1IP                         4461
#define ADIP                          4462
#define PSPIP                         4463
#define PIE2                          4464
#define TMR3GIE                       4465
#define TMR3IE                        4466
#define HLVDIE                        4467
#define LVDIE                         4468
#define BCLIE                         4469
#define OSCFIE                        4470
#define PIR2                          4471
#define TMR3GIF                       4472
#define TMR3IF                        4473
#define HLVDIF                        4474
#define LVDIF                         4475
#define BCLIF                         4476
#define OSCFIF                        4477
#define IPR2                          4478
#define TMR3GIP                       4479
#define TMR3IP                        4480
#define HLVDIP                        4481
#define LVDIP                         4482
#define BCLIP                         4483
#define OSCFIP                        4484
#define PIE3                          4485
#define RXBNIE                        4486
#define PIE3_RXB1IE                   4487
#define CCP1IE                        4488
#define CCP2IE                        4489
#define PIE3_TXB0IE                   4490
#define CTMUIE                        4491
#define PIE3_TXB1IE                   4492
#define TXBNIE                        4493
#define PIE3_TXB2IE                   4494
#define PIE3_TX2IE                    4495
#define RC2IE                         4496
#define PIR3                          4497
#define RXBNIF                        4498
#define CCP1IF                        4499
#define CCP2IF                        4500
#define CTMUIF                        4501
#define TXBNIF                        4502
#define PIR3_TX2IF                    4503
#define RC2IF                         4504
#define IPR3                          4505
#define CCP1IP                        4506
#define RXBNIP                        4507
#define CCP2IP                        4508
#define CTMUIP                        4509
#define TX2IP                         4510
#define TXBNIP                        4511
#define RC2IP                         4512
#define RCSTA2                        4513
#define RCD82                         4514
#define RX9D2                         4515
#define RCSTA2_RX9D                   4516
#define OERR2                         4517
#define RCSTA2_OERR                   4518
#define FERR2                         4519
#define RCSTA2_FERR                   4520
#define ADDEN2                        4521
#define RCSTA2_ADDEN                  4522
#define RCSTA2_CREN                   4523
#define CREN2                         4524
#define SREN2                         4525
#define RCSTA2_SREN                   4526
#define RC92                          4527
#define RC8_92                        4528
#define RCSTA2_RX9                    4529
#define RX92                          4530
#define RCSTA2_SPEN                   4531
#define SPEN2                         4532
#define BAUDCON1                      4533
#define BAUDCON1_ABDEN                4534
#define ABDEN1                        4535
#define BAUDCON1_WUE                  4536
#define WUE1                          4537
#define BRG161                        4538
#define BAUDCON1_BRG16                4539
#define CKTXP                         4540
#define BAUDCON1_TXCKP                4541
#define SCKP1                         4542
#define TXCKP1                        4543
#define SCKP                          4544
#define DTRXP1                        4545
#define RXDTP1                        4546
#define DTRXP                         4547
#define BAUDCON1_RXDTP                4548
#define BAUDCON1_RCMT                 4549
#define RCMT1                         4550
#define RCIDL1                        4551
#define BAUDCON1_RCIDL                4552
#define ABDOVF1                       4553
#define BAUDCON1_ABDOVF               4554
#define HLVDCON                       4555
#define HLVDL                         4556
#define HLVDL0                        4557
#define HLVDL1                        4558
#define HLVDL2                        4559
#define HLVDL3                        4560
#define HLVDEN                        4561
#define IRVST                         4562
#define BGVST                         4563
#define VDIRMAG                       4564
#define PR4                           4565
#define T1GCON                        4566
#define T1GSS0                        4567
#define T1GSS                         4568
#define T1GSS1                        4569
#define T1GVAL                        4570
#define T1GGO_nT1DONE                 4571
#define nT1DONE                       4572
#define T1GGO_NOT_T1DONE              4573
#define NOT_T1DONE                    4574
#define T1GGO                         4575
#define T1GSPM                        4576
#define T1GTM                         4577
#define T1GPOL                        4578
#define TMR1GE                        4579
#define RCSTA1                        4580
#define RCSTA1_RX9D                   4581
#define RX9D1                         4582
#define RCD8                          4583
#define RCSTA1_OERR                   4584
#define OERR1                         4585
#define RCSTA1_FERR                   4586
#define FERR1                         4587
#define RCSTA1_ADDEN                  4588
#define ADDEN1                        4589
#define ADEN                          4590
#define RCSTA1_CREN                   4591
#define CREN1                         4592
#define SRENA                         4593
#define SREN1                         4594
#define RCSTA1_SREN                   4595
#define RC8_9                         4596
#define RCSTA1_RX9                    4597
#define nRC8                          4598
#define NOT_RC8                       4599
#define RC9                           4600
#define RX91                          4601
#define RCSTA1_SPEN                   4602
#define SPEN1                         4603
#define TXSTA1                        4604
#define TX9D1                         4605
#define TXSTA1_TX9D                   4606
#define TXD8                          4607
#define TRMT1                         4608
#define TXSTA1_TRMT                   4609
#define BRGH1                         4610
#define TXSTA1_BRGH                   4611
#define TXSTA1_SENDB                  4612
#define SENDB1                        4613
#define TXSTA1_SYNC                   4614
#define SYNC1                         4615
#define TXEN1                         4616
#define TXSTA1_TXEN                   4617
#define TX91                          4618
#define TX8_9                         4619
#define NOT_TX8                       4620
#define nTX8                          4621
#define TXSTA1_TX9                    4622
#define TXSTA1_CSRC                   4623
#define CSRC1                         4624
#define TXREG1                        4625
#define RCREG1                        4626
#define SPBRG1                        4627
#define T3GCON                        4628
#define T3GSS0                        4629
#define T3GSS                         4630
#define T3GSS1                        4631
#define T3GVAL                        4632
#define T3GGO                         4633
#define NOT_T3DONE                    4634
#define nT3DONE                       4635
#define T3GGO_nT3DONE                 4636
#define T3GGO_NOT_T3DONE              4637
#define T3GSPM                        4638
#define T3GTM                         4639
#define T3GPOL                        4640
#define TMR3GE                        4641
#define T3CON                         4642
#define TMR3ON                        4643
#define T3CON_RD16                    4644
#define nT3SYNC                       4645
#define NOT_T3SYNC                    4646
#define SOSCEN3                       4647
#define T3CON_SOSCEN                  4648
#define T3CKPS0                       4649
#define T3CKPS                        4650
#define T3CKPS1                       4651
#define TMR3CS0                       4652
#define TMR3CS                        4653
#define TMR3CS1                       4654
#define T3RD16                        4655
#define RD163                         4656
#define TMR3L                         4657
#define TMR3H                         4658
#define CMSTAT                        4659
#define C2OUT                         4660
#define CMP1OUT                       4661
#define C3OUT                         4662
#define CMP2OUT                       4663
#define CVRCON                        4664
#define CVR                           4665
#define CVR0                          4666
#define CVR1                          4667
#define CVR2                          4668
#define CVR3                          4669
#define CVR4                          4670
#define CVRR                          4671
#define CVRSS                         4672
#define CVROEN                        4673
#define CVROE                         4674
#define CVREN                         4675
#define PIE4                          4676
#define CCP3IE                        4677
#define CCP4IE                        4678
#define CCP5IE                        4679
#define CMP1IE                        4680
#define CMP2IE                        4681
#define EEIE                          4682
#define TMR4IE                        4683
#define PIR4                          4684
#define CCP3IF                        4685
#define CCP4IF                        4686
#define CCP5IF                        4687
#define CMP1IF                        4688
#define CMP2IF                        4689
#define EEIF                          4690
#define TMR4IF                        4691
#define IPR4                          4692
#define CCIP3IP                       4693
#define CCP3IP                        4694
#define CCP4IP                        4695
#define CCP5IP                        4696
#define CMP1IP                        4697
#define CMP2IP                        4698
#define EEIP                          4699
#define TMR4IP                        4700
#define BAUDCON2                      4701
#define ABDEN2                        4702
#define BAUDCON2_ABDEN                4703
#define WUE2                          4704
#define BAUDCON2_WUE                  4705
#define BRG162                        4706
#define BAUDCON2_BRG16                4707
#define SCKP2                         4708
#define TXCKP2                        4709
#define BAUDCON2_TXCKP                4710
#define DTRXP2                        4711
#define RXDTP2                        4712
#define BAUDCON2_RXDTP                4713
#define RCMT2                         4714
#define RCIDL2                        4715
#define BAUDCON2_RCIDL                4716
#define BAUDCON2_RCMT                 4717
#define BAUDCON2_ABDOVF               4718
#define ABDOVF2                       4719
#define TXSTA2                        4720
#define TX9D2                         4721
#define TXSTA2_TX9D                   4722
#define TXD82                         4723
#define TRMT2                         4724
#define TXSTA2_TRMT                   4725
#define BRGH2                         4726
#define TXSTA2_BRGH                   4727
#define SENDB2                        4728
#define TXSTA2_SENDB                  4729
#define TXSTA2_SYNC                   4730
#define SYNC2                         4731
#define TXEN2                         4732
#define TXSTA2_TXEN                   4733
#define TX8_92                        4734
#define TX92                          4735
#define TXSTA2_TX9                    4736
#define TXSTA2_CSRC                   4737
#define CSRC2                         4738
#define CCP1CON                       4739
#define CCP1M0                        4740
#define CCP1M                         4741
#define CCP1M1                        4742
#define CCP1M2                        4743
#define CCP1M3                        4744
#define CCP1Y                         4745
#define DC1B                          4746
#define DC1B0                         4747
#define CCP1X                         4748
#define DC1B1                         4749
#define P1M                           4750
#define P1M0                          4751
#define P1M1                          4752
#define CCPR1L                        4753
#define CCPR1H                        4754
#define ECCP1DEL                      4755
#define P1DC                          4756
#define P1DC0                         4757
#define P1DC1                         4758
#define P1DC2                         4759
#define P1DC3                         4760
#define P1DC4                         4761
#define P1DC5                         4762
#define P1DC6                         4763
#define P1RSEN                        4764
#define PSS1BD0                       4765
#define PSS1BD                        4766
#define PSS1BD1                       4767
#define PSS1AC                        4768
#define PSS1AC0                       4769
#define PSS1AC1                       4770
#define ECCP1AS                       4771
#define ECCP1AS0                      4772
#define ECCP1AS1                      4773
#define ECCP1AS2                      4774
#define ECCP1ASE                      4775
#define ADCON2                        4776
#define ADCS0                         4777
#define ADCS                          4778
#define ADCS1                         4779
#define ADCS2                         4780
#define ACQT0                         4781
#define ACQT                          4782
#define ACQT1                         4783
#define ACQT2                         4784
#define ADFM                          4785
#define ADCON1                        4786
#define CHSN0                         4787
#define CHSN                          4788
#define CHSN1                         4789
#define CHSN2                         4790
#define VNCFG                         4791
#define CHSN3                         4792
#define VCFG                          4793
#define VCFG01                        4794
#define VCFG0                         4795
#define VCFG11                        4796
#define VCFG1                         4797
#define TRIGSEL                       4798
#define TRIGSEL0                      4799
#define TRIGSEL1                      4800
#define ADCON0                        4801
#define ADON                          4802
#define nDONE                         4803
#define GO_nDONE                      4804
#define NOT_DONE                      4805
#define GODONE                        4806
#define GO_DONE                       4807
#define DONE                          4808
#define GO_NOT_DONE                   4809
#define GO                            4810
#define CHS0                          4811
#define CHS                           4812
#define CHS1                          4813
#define CHS2                          4814
#define CHS3                          4815
#define CHS4                          4816
#define ADRESL                        4817
#define ADRESH                        4818
#define SSPCON2                       4819
#define SEN                           4820
#define RSEN                          4821
#define ADMSK1                        4822
#define PEN                           4823
#define ADMSK2                        4824
#define RCEN                          4825
#define ADMSK3                        4826
#define ACKEN                         4827
#define ADMSK4                        4828
#define ADMSK5                        4829
#define ACKDT                         4830
#define ACKSTAT                       4831
#define GCEN                          4832
#define SSPCON1                       4833
#define SSPM0                         4834
#define SSPM                          4835
#define SSPM1                         4836
#define SSPM2                         4837
#define SSPM3                         4838
#define CKP                           4839
#define SSPEN                         4840
#define SSPOV                         4841
#define WCOL                          4842
#define SSPSTAT                       4843
#define BF                            4844
#define UA                            4845
#define R_NOT_W                       4846
#define READ_WRITE                    4847
#define NOT_W                         4848
#define R_W                           4849
#define nW                            4850
#define RW                            4851
#define nWRITE                        4852
#define NOT_WRITE                     4853
#define R_nW                          4854
#define I2C_READ                      4855
#define START                         4856
#define S                             4857
#define I2C_START                     4858
#define STOP                          4859
#define I2C_STOP                      4860
#define P                             4861
#define NOT_A                         4862
#define DATA_ADDRESS                  4863
#define nA                            4864
#define D_A                           4865
#define D_nA                          4866
#define DA                            4867
#define D_NOT_A                       4868
#define NOT_ADDRESS                   4869
#define nADDRESS                      4870
#define I2C_DAT                       4871
#define CKE                           4872
#define SMP                           4873
#define SSPADD                        4874
#define MSK0                          4875
#define MSK1                          4876
#define MSK2                          4877
#define MSK3                          4878
#define MSK4                          4879
#define MSK5                          4880
#define MSK6                          4881
#define MSK7                          4882
#define SSPBUF                        4883
#define T2CON                         4884
#define T2CKPS0                       4885
#define T2CKPS                        4886
#define T2CKPS1                       4887
#define TMR2ON                        4888
#define T2OUTPS0                      4889
#define T2OUTPS                       4890
#define T2OUTPS1                      4891
#define T2OUTPS2                      4892
#define T2OUTPS3                      4893
#define WM0                           4894
#define PR2                           4895
#define WM1                           4896
#define WAIT0                         4897
#define WAIT1                         4898
#define EBDIS                         4899
#define TMR2                          4900
#define T1CON                         4901
#define TMR1ON                        4902
#define T1CON_RD16                    4903
#define NOT_T1SYNC                    4904
#define nT1SYNC                       4905
#define T1OSCEN                       4906
#define T1CON_SOSCEN                  4907
#define T1CKPS0                       4908
#define T1CKPS                        4909
#define T1CKPS1                       4910
#define TMR1CS0                       4911
#define TMR1CS                        4912
#define T1RD16                        4913
#define TMR1CS1                       4914
#define TMR1L                         4915
#define TMR1H                         4916
#define RCON                          4917
#define BOR                           4918
#define NOT_BOR                       4919
#define nBOR                          4920
#define POR                           4921
#define nPOR                          4922
#define NOT_POR                       4923
#define PD                            4924
#define nPD                           4925
#define NOT_PD                        4926
#define nTO                           4927
#define TO                            4928
#define NOT_TO                        4929
#define nRI                           4930
#define NOT_RI                        4931
#define RI                            4932
#define NOT_CM                        4933
#define CM                            4934
#define nCM                           4935
#define SBOREN                        4936
#define IPEN                          4937
#define WDTCON                        4938
#define SWDTEN                        4939
#define SWDTE                         4940
#define ULPSINK                       4941
#define ULPEN                         4942
#define SRETEN                        4943
#define ULPLVL                        4944
#define REGSLP                        4945
#define OSCCON2                       4946
#define LVDL0                         4947
#define MFIOSEL                       4948
#define MFIOFS                        4949
#define LVDL1                         4950
#define LVDL2                         4951
#define SOSCGO                        4952
#define LVDL3                         4953
#define SOSCDRV                       4954
#define SOSCRUN                       4955
#define OSCCON                        4956
#define SCS0                          4957
#define SCS                           4958
#define SCS1                          4959
#define HFIOFS                        4960
#define OSTS                          4961
#define IRCF                          4962
#define IRCF0                         4963
#define IRCF1                         4964
#define IRCF2                         4965
#define IDLEN                         4966
#define T0CON                         4967
#define T0PS                          4968
#define T0PS0                         4969
#define T0PS1                         4970
#define T0PS2                         4971
#define PSA                           4972
#define T0SE                          4973
#define T0CS                          4974
#define T08BIT                        4975
#define TMR0ON                        4976
#define TMR0L                         4977
#define TMR0H                         4978
#define STATUS                        4979
#define C                             4980
#define CARRY                         4981
#define DC                            4982
#define ZERO                          4983
#define Z                             4984
#define OV                            4985
#define OVERFLOW                      4986
#define N                             4987
#define NEGATIVE                      4988
#define FSR2L                         4989
#define FSR2H                         4990
#define PLUSW2                        4991
#define PREINC2                       4992
#define POSTDEC2                      4993
#define POSTINC2                      4994
#define INDF2                         4995
#define BSR                           4996
