tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf46k80_tdd.h
#define FSR1L                         4997
#define FSR1H                         4998
#define PLUSW1                        4999
#define PREINC1                       5000
#define POSTDEC1                      5001
#define POSTINC1                      5002
#define INDF1                         5003
#define WREG                          5004
#define FSR0L                         5005
#define FSR0H                         5006
#define PLUSW0                        5007
#define PREINC0                       5008
#define POSTDEC0                      5009
#define POSTINC0                      5010
#define INDF0                         5011
#define INTCON3                       5012
#define INT1IF                        5013
#define INT1F                         5014
#define INT2IF                        5015
#define INT2F                         5016
#define INT3F                         5017
#define INT3IF                        5018
#define INT1E                         5019
#define INT1IE                        5020
#define INT2IE                        5021
#define INT2E                         5022
#define INT3E                         5023
#define INT3IE                        5024
#define INT1P                         5025
#define INT1IP                        5026
#define INT2IP                        5027
#define INT2P                         5028
#define INTCON2                       5029
#define RBIP                          5030
#define INT3IP                        5031
#define INT3P                         5032
#define TMR0IP                        5033
#define T0IP                          5034
#define INTEDG3                       5035
#define INTEDG2                       5036
#define INTEDG1                       5037
#define INTEDG0                       5038
#define RBPU                          5039
#define NOT_RBPU                      5040
#define nRBPU                         5041
#define INTCON                        5042
#define RBIF                          5043
#define INT0F                         5044
#define INT0IF                        5045
#define T0IF                          5046
#define TMR0IF                        5047
#define RBIE                          5048
#define INT0E                         5049
#define INT0IE                        5050
#define T0IE                          5051
#define TMR0IE                        5052
#define PEIE                          5053
#define PEIE_GIEL                     5054
#define GIEL                          5055
#define GIE_GIEH                      5056
#define GIE                           5057
#define GIEH                          5058
#define PRODL                         5059
#define PRODH                         5060
#define TABLAT                        5061
#define TBLPTRL                       5062
#define TBLPTRH                       5063
#define TBLPTRU                       5064
#define PCL                           5065
#define PCLATH                        5066
#define PCH                           5067
#define PCLATU                        5068
#define PCU                           5069
#define SP0                           5070
#define STKPTR                        5071
#define SP1                           5072
#define SP2                           5073
#define SP3                           5074
#define SP4                           5075
#define STKUNF                        5076
#define STKOVF                        5077
#define STKFUL                        5078
#define TOSL                          5079
#define TOSH                          5080
#define TOSU                          5081

#endif // _PIC18LF46K80_H_
